{
  "version": "1.0.0",
  "hosts": [
    { "host": "giftshop.club", "reason": "Attacker-controlled domain used by malicious postmark-mcp npm package to receive BCC'd emails (CLAW-2025-001).", "severity": "critical" },
    { "host": "phan@giftshop.club", "reason": "Attacker email address used as BCC recipient in postmark-mcp supply chain attack.", "severity": "critical" },
    { "host": "169.254.169.254", "reason": "AWS/GCP/Azure cloud metadata endpoint. Access from MCP tools indicates SSRF exploitation (CVE-2025-53109).", "severity": "critical" },
    { "host": "metadata.google.internal", "reason": "GCP metadata endpoint. Access from MCP tools indicates SSRF attack.", "severity": "critical" },
    { "host": "169.254.170.2", "reason": "AWS ECS task metadata endpoint. Access from MCP tools indicates SSRF.", "severity": "high" },
    { "host": "fd00:ec2::254", "reason": "AWS IPv6 instance metadata endpoint. MCP tool access indicates SSRF.", "severity": "high" },
    { "host": "0177.0.0.1", "reason": "Octal encoding of 127.0.0.1 used in SSRF bypass techniques against MCP server URL validation.", "severity": "high" },
    { "host": "0x7f000001", "reason": "Hex encoding of 127.0.0.1 used in SSRF bypass techniques.", "severity": "high" },
    { "host": "2130706433", "reason": "Decimal encoding of 127.0.0.1 used in SSRF bypass techniques.", "severity": "high" },
    { "host": "localhost.localdomain", "reason": "Local loopback alias used in SSRF bypass against hostname validation.", "severity": "medium" },
    { "host": "0.0.0.0", "reason": "Wildcard/any-interface binding. MCP tools should never connect to this address.", "severity": "medium" },
    { "host": "100.64.0.0/10", "reason": "Carrier-grade NAT range (RFC 6598). Connections from MCP tools to this range are suspicious.", "severity": "medium" },
    { "host": "*.burpcollaborator.net", "reason": "Burp Collaborator domains used in OAST (Out-of-band Application Security Testing). Presence in MCP tool calls indicates exploitation attempts or unauthorized security testing.", "severity": "high" },
    { "host": "*.oastify.com", "reason": "Burp Suite OAST domain used for out-of-band interaction detection. Indicates active exploitation probing.", "severity": "high" },
    { "host": "*.interact.sh", "reason": "ProjectDiscovery Interactsh domain used for out-of-band vulnerability confirmation. Indicates exploitation testing.", "severity": "high" },
    { "host": "*.ngrok.io", "reason": "ngrok tunnel endpoints. MCP servers connecting to ngrok tunnels may indicate data exfiltration or C2 communication.", "severity": "medium" },
    { "host": "*.ngrok-free.app", "reason": "ngrok free tier tunnel endpoints used for C2 or data staging in MCP attacks.", "severity": "medium" },
    { "host": "*.trycloudflare.com", "reason": "Cloudflare quick tunnels used for ephemeral C2 or data exfiltration endpoints in MCP attacks.", "severity": "medium" },
    { "host": "*.serveo.net", "reason": "SSH tunnel service used as ephemeral C2 endpoints.", "severity": "medium" },
    { "host": "*.pipedream.net", "reason": "Pipedream webhook endpoints used to receive exfiltrated data from compromised MCP tools.", "severity": "medium" },
    { "host": "*.webhook.site", "reason": "Webhook.site endpoints used to capture exfiltrated data from MCP tool attacks.", "severity": "medium" },
    { "host": "*.requestbin.com", "reason": "RequestBin endpoints used for data exfiltration in MCP prompt injection attacks.", "severity": "medium" },
    { "host": "*.requestcatcher.com", "reason": "Request catcher service used to capture exfiltrated data.", "severity": "medium" },
    { "host": "raw.githubusercontent.com", "reason": "GitHub raw content used to host second-stage payloads in supply chain attacks. Not malicious by default but commonly abused.", "severity": "low" },
    { "host": "paste.ee", "reason": "Paste service frequently used for data staging and exfiltration in supply chain attacks.", "severity": "medium" },
    { "host": "pastebin.com", "reason": "Paste service commonly used for C2 communication and data staging in malware operations.", "severity": "low" },
    { "host": "transfer.sh", "reason": "File sharing service used for data exfiltration in npm supply chain attacks.", "severity": "medium" },
    { "host": "file.io", "reason": "Ephemeral file sharing service used for data exfiltration. Files auto-delete after first download.", "severity": "medium" },
    { "host": "*.dnslog.cn", "reason": "DNS logging service used for out-of-band data exfiltration via DNS queries.", "severity": "high" },
    { "host": "*.ceye.io", "reason": "DNS/HTTP callback service used for blind SSRF and data exfiltration confirmation.", "severity": "high" },
    { "host": "*.bingsecuritycenter.com", "reason": "Known phishing domain impersonating Microsoft security services.", "severity": "high" },
    { "host": "224.0.0.0/4", "reason": "Multicast range. MCP tools should not use multicast.", "severity": "low" },
    { "host": "255.255.255.255", "reason": "Broadcast address. MCP tools should never target broadcast.", "severity": "medium" }
  ]
}
