{
  "version": "1.0.0",
  "tools": [
    { "name": "curl | bash", "description": "Piping remote content directly to shell execution. Common malware installation vector in MCP supply chain attacks.", "severity": "critical" },
    { "name": "wget -O - | sh", "description": "Downloading and executing remote content. Used in MCP server post-install exploitation.", "severity": "critical" },
    { "name": "eval $(base64 -d", "description": "Base64-decoded command execution. Used to obfuscate payloads in MCP tool poisoning attacks.", "severity": "critical" },
    { "name": "python -c 'import socket'", "description": "Inline Python with socket import. Used for reverse shell establishment in MCP command injection exploits.", "severity": "high" },
    { "name": "nc -e /bin/sh", "description": "Netcat reverse shell. Triggered via command injection in vulnerable MCP servers (CVE-2025-53107, CVE-2025-59834).", "severity": "critical" },
    { "name": "bash -i >& /dev/tcp/", "description": "Bash interactive reverse shell via TCP redirect. Common payload in MCP command injection chains.", "severity": "critical" },
    { "name": "child_process.exec(", "description": "Node.js child_process.exec with unsanitized input. Root cause of CVE-2025-6514, CVE-2025-54073, CVE-2025-59834, CVE-2025-53107, and many other MCP command injection vulnerabilities.", "severity": "high" },
    { "name": "child_process.execSync(", "description": "Synchronous shell execution in Node.js. Same class of vulnerability as exec() but blocks the event loop.", "severity": "high" },
    { "name": "chmod +x /tmp/", "description": "Making temporary files executable. Indicates malware staging from MCP server exploitation.", "severity": "high" },
    { "name": "ssh-keygen -t", "description": "SSH key generation. May indicate unauthorized key creation for persistence after MCP server compromise.", "severity": "medium" },
    { "name": "security find-generic-password", "description": "macOS Keychain password query. Credential theft technique used after MCP sandbox escape.", "severity": "critical" },
    { "name": "security dump-keychain", "description": "macOS Keychain dump. Mass credential theft after privilege escalation via MCP server compromise.", "severity": "critical" },
    { "name": "launchctl load", "description": "Loading macOS launch agent/daemon. Persistence mechanism following MCP server compromise.", "severity": "high" },
    { "name": "crontab -e", "description": "Cron job modification. Used for persistence after MCP command injection exploitation.", "severity": "high" },
    { "name": "xattr -d com.apple.quarantine", "description": "Removing macOS quarantine attribute. Bypasses Gatekeeper for dropped malware.", "severity": "high" },
    { "name": "env | curl", "description": "Exfiltrating environment variables (API keys, tokens) via HTTP. Common in MCP credential theft chains.", "severity": "critical" },
    { "name": "printenv | nc", "description": "Piping environment variables to netcat. Exfiltration technique in MCP exploits.", "severity": "critical" },
    { "name": "tar czf - | curl", "description": "Creating compressed archive and streaming to remote endpoint. Data exfiltration technique.", "severity": "high" },
    { "name": "cat ~/.ssh/id_rsa", "description": "Reading SSH private keys. Core step in MCP credential theft kill chains.", "severity": "critical" },
    { "name": "cat ~/.npmrc", "description": "Reading npm authentication tokens. Targeted by supply chain attacks for lateral movement.", "severity": "critical" },
    { "name": "cat ~/.aws/credentials", "description": "Reading AWS credentials. Cloud credential theft following MCP sandbox escape.", "severity": "critical" },
    { "name": "cat ~/.config/gh/hosts.yml", "description": "Reading GitHub CLI authentication. Targeted for repository compromise in supply chain attacks.", "severity": "critical" },
    { "name": "rm -rf /", "description": "Recursive forced deletion of root. Destructive command that may appear in MCP sabotage attacks.", "severity": "critical" },
    { "name": "dd if=/dev/zero of=", "description": "Disk overwrite. Destructive payload used in Shai-Hulud 2.0 sabotage mechanism.", "severity": "critical" },
    { "name": "mkfifo /tmp/", "description": "Named pipe creation in /tmp. Used in reverse shell establishment after MCP command injection.", "severity": "high" },
    { "name": "npm publish --access public", "description": "Publishing to npm. May indicate worm self-replication (Shai-Hulud pattern).", "severity": "high" },
    { "name": "screencapture", "description": "macOS screenshot capture. Surveillance technique after MCP compromise.", "severity": "high" },
    { "name": "osascript -e", "description": "AppleScript execution. Used for privilege escalation, UI manipulation, and credential prompting after MCP compromise.", "severity": "medium" },
    { "name": "open -a", "description": "macOS application launch. May be used to trigger authorization_endpoint URLs in mcp-remote command injection (CVE-2025-6514).", "severity": "medium" },
    { "name": "xdg-open", "description": "Linux URL/file opener. Exploited in mcp-remote command injection (CVE-2025-6514) for arbitrary command execution.", "severity": "medium" },
    { "name": "nohup", "description": "Running process immune to hangups. Persistence mechanism for background payloads.", "severity": "medium" },
    { "name": "base64 -d", "description": "Base64 decoding. Common obfuscation technique for payloads in MCP tool poisoning.", "severity": "medium" },
    { "name": "tcpdump", "description": "Network packet capture. May indicate network surveillance after MCP server compromise.", "severity": "high" }
  ]
}
